Repository: sanajaved7/durhamforall
Catalog: durhamforall/locale/*/LC_MESSAGES/django.po
Languages: es

source: Page not found
es: Página no encontrada

source: Sorry, this page could not be found.
es: Lo sentimos; no se pudo encontrar la página solicitada.

source: Internal server error
es: Error interno del servidor

source: Sorry, there seems to be an error. Please try again soon.
es: Lo sentimos, parece que se produjo un error. Favor de intentar de nuevo más tarde.

source: Durham for All
es: Durham para Tod@s

source: Donate
es: Donar

source: Join Us!
es: ¡Únete con nosotr@s!

source: Contact Us
es: Contáctanos

source: 10k Strong is about breaking the racial, economic, and fear barriers that keep Durham&#039;s progressive majority from actually coming together and making the changes that would really impact our people&#039;s lives.
es: La Fuerza de 10 Mil busca romper las barreras raciales, económicas y de miedo que hacen que la mayoría progresista de Durham nunca una esfuerzos para hacer los cambios que realmente podrían beneficiar las vidas de nuestra comunidad.

source: Durham, sign the #10kStrong Pledge at: durhamforall.org/pledge
es: Durham, Únete al movimiento de #Fuerzade10Mil en: durhamforall.org/pledge

source: Created by Ashlyn Nuckols. Music by Sijal Nasralla.
es: Creado por Ashlyn Nuckols. Música por Sijal Nasralla

source: Posted by
es: Subido por
